<script setup>
import { ref } from 'vue'

const star = ref(0)

const setRating = (value) => {
  star.value = value
}
</script>

<template>
  <div class="w-[23.4375rem] z-50 bg-white">
    <a href="#" class="bg-[#274138] py-5 flex justify-center">
      <svg
        width="110"
        height="23"
        viewBox="0 0 110 23"
        fill="none"
        xmlns="http://www.w3.org/2000/svg"
      >
        <g clip-path="url(#clip0_11901_8545)">
          <path
            d="M0 11.4626C0 16.6336 1.95075 20.6838 3.49615 22.9254H5.39623C3.69882 20.1742 2.38143 16.277 2.38143 11.4626C2.38143 6.64834 3.69882 2.72556 5.39623 0H3.49615C1.95075 2.21612 0 6.29172 0 11.4626Z"
            fill="white"
          />
          <path
            d="M29.9887 20.4735L35.0555 4.3748V20.4735H37.6396V2.00586H33.3074L28.6206 17.3913L23.9337 2.00586H19.6016V20.4735H22.1857V4.3748L27.2526 20.4735H29.9887Z"
            fill="white"
          />
          <path d="M44.5763 2.00586H41.9922V20.4735H44.5763V2.00586Z" fill="white" />
          <path
            d="M51.5284 2.00586H48.9443V20.4735H61.2315V18.2319H51.5284V2.00586Z"
            fill="white"
          />
          <path
            d="M66.0021 2.00586H63.418V20.4735H66.0021V14.6657L68.8901 11.4562L75.1985 20.4735H78.2893L70.6382 9.54574L77.5039 2.00586H74.2865L66.0021 11.3033V2.00586Z"
            fill="white"
          />
          <path
            d="M77.8643 2.00586L84.3497 13.2647V20.4735H86.9338V13.3157L93.6728 2.00586H90.8353L85.7178 11.0231L80.7016 2.00586H77.8643Z"
            fill="white"
          />
          <path
            d="M109.979 11.4626C109.979 6.29172 108.029 2.21612 106.483 0H104.583C106.255 2.7001 107.598 6.6738 107.598 11.4626C107.598 16.277 106.281 20.1742 104.583 22.9254H106.483C108.029 20.6838 109.979 16.6336 109.979 11.4626Z"
            fill="white"
          />
        </g>
        <defs>
          <clipPath id="clip0_11901_8545">
            <rect width="110" height="23" fill="white" />
          </clipPath>
        </defs>
      </svg>
    </a>
    <div class="px-[3.875rem] py-[1.875rem] flex flex-col justify-center">
      <p class="text-xl text-center">Как вам визит?</p>
      <div
        class="flex items-center justify-center text-[#8C9497] font-light text-sm pt-[0.3125rem]"
      >
        21.05.2022 | Студия на Арбате
      </div>
      <div class="flex items-center justify-center pt-[1.1044rem] pb-11">
        <div class="flex justify-center gap-2">
          <template v-for="i in 5" :key="i">
            <svg
              @click="setRating(i)"
              width="35"
              height="33"
              viewBox="0 0 35 33"
              fill="none"
              xmlns="http://www.w3.org/2000/svg"
              class="cursor-pointer transition-colors duration-200"
            >
              <path
                d="M32.9728 11.793L23.0548 10.3516L18.6212 1.3633C18.5001 1.1172 18.3009 0.917983 18.0548 0.796889C17.4376 0.492202 16.6876 0.746108 16.379 1.3633L11.9454 10.3516L2.02748 11.793C1.75404 11.832 1.50404 11.961 1.31263 12.1563C1.08123 12.3941 0.953723 12.7141 0.958118 13.0459C0.962513 13.3777 1.09845 13.6942 1.33607 13.9258L8.51185 20.9219L6.81654 30.8008C6.77678 31.0306 6.80221 31.2669 6.88995 31.483C6.97768 31.6991 7.1242 31.8863 7.3129 32.0234C7.5016 32.1604 7.72493 32.2418 7.95755 32.2584C8.19018 32.275 8.4228 32.2261 8.62904 32.1172L17.5001 27.4531L26.3712 32.1172C26.6134 32.2461 26.8947 32.2891 27.1642 32.2422C27.8439 32.125 28.3009 31.4805 28.1837 30.8008L26.4884 20.9219L33.6642 13.9258C33.8595 13.7344 33.9884 13.4844 34.0275 13.211C34.1329 12.5274 33.6564 11.8945 32.9728 11.793Z"
                :fill="i <= star ? '#FBBF24' : '#E5E7EB'"
              />
            </svg>
          </template>
        </div>
      </div>
    </div>
  </div>
</template>
