<script setup>
import { ref } from 'vue'

const props = defineProps({
  rating: Number,
  comment: String,
})

const showSuccess = ref(true)

function copyComment() {
  navigator.clipboard.writeText(props.comment)
}
</script>
<template>
  <div
    v-if="props.rating < 5 && showSuccess"
    class="max-w-[21.1875rem] w-full bg-[#274138] relative rounded-[1.125rem] mt-5 pt-8.5 px-9 pb-12 text-white"
  >
    <button
      type="button"
      @click="showSuccess = false"
      class="absolute right-6 top-5 cursor-pointer"
    >
      <svg
        width="14"
        height="14"
        viewBox="0 0 14 14"
        fill="none"
        xmlns="http://www.w3.org/2000/svg"
      >
        <path
          d="M13.1464 0.146419C13.3417 -0.0486996 13.6583 -0.0488165 13.8535 0.146419C14.0486 0.341656 14.0485 0.658151 13.8535 0.85345L7.70599 7.00189L13.8535 13.1513C14.0485 13.3466 14.0486 13.6631 13.8535 13.8583C13.6583 14.0534 13.3416 14.0534 13.1464 13.8583L6.99994 7.70892L0.853454 13.8583C0.658309 14.0535 0.341674 14.0534 0.146423 13.8583C-0.0487911 13.6631 -0.048758 13.3466 0.146423 13.1513L6.29291 7.00189L0.146423 0.85345C-0.0488077 0.658156 -0.0488077 0.341712 0.146423 0.146419C0.341662 -0.0487719 0.658258 -0.0488406 0.853454 0.146419L6.99994 6.29486L13.1464 0.146419Z"
          fill="white"
        />
      </svg>
    </button>
    <h2 class="font-medium text-center max-w-40 mx-auto leading-[1.5625rem]">
      Ваш отзыв успешно отправлен 😌
    </h2>
    <div class="flex justify-between mt-7.5">
      <p class="text-[0.8125rem] max-w-42">
        Мы свяжемся с вами в течение дня для уточнения деталей или решения проблемы
      </p>
      <div class="flex-end relative -bottom-5">
        <img
          src="/src/assets/images/sad-kitty.png"
          alt="Sad Kitty"
          class="w-20 h-20 relative cover"
        />
      </div>
    </div>
  </div>
  <div
    v-if="props.rating === 5 && comment && showSuccess"
    class="max-w-[21.1875rem] w-full bg-[#274138] relative rounded-[1.125rem] mt-5 pt-8.5 px-6.5 pb-8 text-white"
  >
    <button
      type="button"
      @click="showSuccess = false"
      class="absolute right-6 top-5 cursor-pointer"
    >
      <svg
        width="14"
        height="14"
        viewBox="0 0 14 14"
        fill="none"
        xmlns="http://www.w3.org/2000/svg"
      >
        <path
          d="M13.1464 0.146419C13.3417 -0.0486996 13.6583 -0.0488165 13.8535 0.146419C14.0486 0.341656 14.0485 0.658151 13.8535 0.85345L7.70599 7.00189L13.8535 13.1513C14.0485 13.3466 14.0486 13.6631 13.8535 13.8583C13.6583 14.0534 13.3416 14.0534 13.1464 13.8583L6.99994 7.70892L0.853454 13.8583C0.658309 14.0535 0.341674 14.0534 0.146423 13.8583C-0.0487911 13.6631 -0.048758 13.3466 0.146423 13.1513L6.29291 7.00189L0.146423 0.85345C-0.0488077 0.658156 -0.0488077 0.341712 0.146423 0.146419C0.341662 -0.0487719 0.658258 -0.0488406 0.853454 0.146419L6.99994 6.29486L13.1464 0.146419Z"
          fill="white"
        />
      </svg>
    </button>
    <h2 class="font-medium text-center mx-auto leading-[1.5625rem]">
      Отлично! <br />Отзыв успешно отправлен :)
    </h2>
    <div class="mt-5 rounded-lg bg-white/5 p-4 flex justify-between">
      <div class="text-[0.625rem]">
        <span class="text-white/50">Ваш отзыв:</span>
        <p class="line-clamp-3 overflow-hidden text-ellipsis leading-3.5">{{ comment }}</p>
      </div>
      <button
        type="button"
        @click="copyComment()"
        class="bg-white px-2 rounded-full cursor-pointer"
      >
        <svg
          width="14"
          height="14"
          viewBox="0 0 14 14"
          fill="none"
          xmlns="http://www.w3.org/2000/svg"
        >
          <path
            d="M8.75033 1.75H5.25033C3.96166 1.75 2.91699 2.79467 2.91699 4.08333V8.75"
            stroke="#274138"
            stroke-width="1.16667"
          />
          <path
            d="M7.875 4.08301C8.57269 4.08301 9.0475 4.08434 9.4082 4.125C9.75707 4.16433 9.92678 4.23433 10.0439 4.32422C10.1248 4.38627 10.1967 4.45917 10.2588 4.54004C10.3487 4.65721 10.4196 4.82683 10.459 5.17578C10.4996 5.53639 10.5 6.01069 10.5 6.70801V9.04199C10.5 9.73931 10.4996 10.2136 10.459 10.5742C10.4196 10.9232 10.3487 11.0928 10.2588 11.21C10.1967 11.2908 10.1248 11.3637 10.0439 11.4258C9.92678 11.5157 9.75707 11.5857 9.4082 11.625C9.0475 11.6657 8.57269 11.667 7.875 11.667C7.17766 11.667 6.70339 11.6656 6.34277 11.625C5.99408 11.5857 5.82419 11.5156 5.70703 11.4258C5.62614 11.3637 5.55328 11.2908 5.49121 11.21C5.4014 11.0928 5.3313 10.9229 5.29199 10.5742C5.25136 10.2136 5.25 9.73933 5.25 9.04199V6.70801C5.25 6.01067 5.25136 5.5364 5.29199 5.17578C5.3313 4.82709 5.4014 4.6572 5.49121 4.54004C5.55328 4.45915 5.62614 4.38629 5.70703 4.32422C5.82419 4.23441 5.99408 4.16431 6.34277 4.125C6.70339 4.08437 7.17766 4.08301 7.875 4.08301Z"
            stroke="#274138"
            stroke-width="1.16667"
          />
        </svg>
      </button>
    </div>
    <div class="flex justify-between mt-7.5 pl-6">
      <p class="text-[0.8125rem] max-w-42">
        Продублируй, пожалуйста, отзыв на Яндекс.Карты, это может нашей студии стать известнее
      </p>
      <div class="flex-end relative -bottom-5">
        <img
          src="/src/assets/images/happy-kitty.png"
          alt="Happy Kitty"
          class="w-20 h-20 relative cover"
        />
      </div>
    </div>
    <a
      href="#"
      target="_blank"
      class="mt-10 bg-[#F6F6F6] py-[0.9375rem] px-4 rounded-sm flex justify-between items-center"
    >
      <div class="flex justify-start items-center gap-2">
        <svg
          width="13"
          height="18"
          viewBox="0 0 13 18"
          fill="none"
          xmlns="http://www.w3.org/2000/svg"
        >
          <path
            d="M6.68555 0.505859C6.91838 0.513034 7.11763 0.524881 7.18359 0.53418C7.28383 0.548313 7.47157 0.58157 7.59375 0.606445C9.41054 0.97652 11.0003 2.29033 11.8584 4.18555C12.0618 4.6348 12.2447 5.18974 12.3232 5.58496L12.3799 5.86719C12.4209 6.07132 12.4724 6.52139 12.4922 6.88281C12.5276 7.5299 12.4441 8.34427 12.2666 9.04395C12.0409 9.93319 11.6374 10.7772 11.084 11.5176C10.9293 11.7245 10.4812 12.2173 10.2236 12.46C9.959 12.7093 9.51973 13.1156 9.44922 13.1768C8.84373 13.7019 7.86696 14.704 7.49023 15.1934C6.93383 15.9161 6.58459 16.6091 6.49805 17.2939C6.44973 16.9545 6.38171 16.7183 6.23633 16.3867C5.98887 15.8225 5.61091 15.2808 5.05762 14.665C4.642 14.2025 3.97005 13.548 3.29688 12.9463C2.51586 12.2481 2.00399 11.682 1.65723 11.1543C1.26237 10.5533 0.941002 9.83102 0.750977 9.11621C0.172306 6.93914 0.610612 4.6057 1.90625 2.88379C2.62169 1.93308 3.55147 1.23062 4.59766 0.839844C5.11097 0.648125 5.59999 0.543262 6.16895 0.503906C6.24794 0.498463 6.45496 0.498755 6.68555 0.505859ZM6.30078 4.16602C5.52334 4.24988 4.8746 4.60518 4.39258 5.21484C3.84749 5.90433 3.612 6.83389 3.75195 7.71191C3.8993 8.63566 4.45162 9.46146 5.24805 9.90234C5.6356 10.1169 5.97359 10.204 6.43262 10.2178C6.55622 10.2215 6.65884 10.223 6.75879 10.2148C6.86403 10.2062 6.95411 10.1877 7.05469 10.165C7.56275 10.0503 7.98882 9.81467 8.3623 9.44531C9.03288 8.78203 9.36121 7.83851 9.26855 6.88477C9.15734 5.7417 8.45107 4.72538 7.41797 4.33301C7.24642 4.2679 7.04565 4.22014 6.86035 4.19141C6.67958 4.16339 6.47447 4.1473 6.30078 4.16602Z"
            fill="#FE4332"
            stroke="black"
          />
        </svg>
        <span class="text-[#274138] text-[0.75rem]"> Перейти в Яндекс.Карты </span>
      </div>
      <svg width="9" height="14" viewBox="0 0 9 14" fill="none" xmlns="http://www.w3.org/2000/svg">
        <path d="M0.742188 1L6.74219 7L0.742188 13" stroke="#274138" stroke-width="2" />
      </svg>
    </a>
  </div>
  <div
    v-if="props.rating === 5 && !comment && showSuccess"
    class="max-w-[21.1875rem] w-full bg-[#274138] relative rounded-[1.125rem] mt-5 pt-8.5 px-6.5 pb-8 text-white"
  >
    <button
      type="button"
      @click="showSuccess = false"
      class="absolute right-6 top-5 cursor-pointer"
    >
      <svg
        width="14"
        height="14"
        viewBox="0 0 14 14"
        fill="none"
        xmlns="http://www.w3.org/2000/svg"
      >
        <path
          d="M13.1464 0.146419C13.3417 -0.0486996 13.6583 -0.0488165 13.8535 0.146419C14.0486 0.341656 14.0485 0.658151 13.8535 0.85345L7.70599 7.00189L13.8535 13.1513C14.0485 13.3466 14.0486 13.6631 13.8535 13.8583C13.6583 14.0534 13.3416 14.0534 13.1464 13.8583L6.99994 7.70892L0.853454 13.8583C0.658309 14.0535 0.341674 14.0534 0.146423 13.8583C-0.0487911 13.6631 -0.048758 13.3466 0.146423 13.1513L6.29291 7.00189L0.146423 0.85345C-0.0488077 0.658156 -0.0488077 0.341712 0.146423 0.146419C0.341662 -0.0487719 0.658258 -0.0488406 0.853454 0.146419L6.99994 6.29486L13.1464 0.146419Z"
          fill="white"
        />
      </svg>
    </button>
    <h2 class="font-medium text-center mx-auto leading-[1.5625rem] px-5">
      Спасибо! <br />
      Ваша оценка успешно отправлена 🫶🏻
    </h2>
    <div class="flex justify-between mt-7.5">
      <p class="text-[0.8125rem] max-w-42">
        Ваша оценка может помочь кому-то при выборе студии — продублируйте его на Яндекс.Карты 😌
      </p>
      <div class="flex-end relative -bottom-5 right-4">
        <img
          src="/src/assets/images/happy-kitty.png"
          alt="Happy Kitty"
          class="w-20 h-20 relative cover"
        />
      </div>
    </div>
    <a
      href="#"
      target="_blank"
      class="mt-10 bg-[#F6F6F6] py-[0.9375rem] px-4 rounded-sm flex justify-between items-center"
    >
      <div class="flex justify-start items-center gap-2">
        <svg
          width="13"
          height="18"
          viewBox="0 0 13 18"
          fill="none"
          xmlns="http://www.w3.org/2000/svg"
        >
          <path
            d="M6.68555 0.505859C6.91838 0.513034 7.11763 0.524881 7.18359 0.53418C7.28383 0.548313 7.47157 0.58157 7.59375 0.606445C9.41054 0.97652 11.0003 2.29033 11.8584 4.18555C12.0618 4.6348 12.2447 5.18974 12.3232 5.58496L12.3799 5.86719C12.4209 6.07132 12.4724 6.52139 12.4922 6.88281C12.5276 7.5299 12.4441 8.34427 12.2666 9.04395C12.0409 9.93319 11.6374 10.7772 11.084 11.5176C10.9293 11.7245 10.4812 12.2173 10.2236 12.46C9.959 12.7093 9.51973 13.1156 9.44922 13.1768C8.84373 13.7019 7.86696 14.704 7.49023 15.1934C6.93383 15.9161 6.58459 16.6091 6.49805 17.2939C6.44973 16.9545 6.38171 16.7183 6.23633 16.3867C5.98887 15.8225 5.61091 15.2808 5.05762 14.665C4.642 14.2025 3.97005 13.548 3.29688 12.9463C2.51586 12.2481 2.00399 11.682 1.65723 11.1543C1.26237 10.5533 0.941002 9.83102 0.750977 9.11621C0.172306 6.93914 0.610612 4.6057 1.90625 2.88379C2.62169 1.93308 3.55147 1.23062 4.59766 0.839844C5.11097 0.648125 5.59999 0.543262 6.16895 0.503906C6.24794 0.498463 6.45496 0.498755 6.68555 0.505859ZM6.30078 4.16602C5.52334 4.24988 4.8746 4.60518 4.39258 5.21484C3.84749 5.90433 3.612 6.83389 3.75195 7.71191C3.8993 8.63566 4.45162 9.46146 5.24805 9.90234C5.6356 10.1169 5.97359 10.204 6.43262 10.2178C6.55622 10.2215 6.65884 10.223 6.75879 10.2148C6.86403 10.2062 6.95411 10.1877 7.05469 10.165C7.56275 10.0503 7.98882 9.81467 8.3623 9.44531C9.03288 8.78203 9.36121 7.83851 9.26855 6.88477C9.15734 5.7417 8.45107 4.72538 7.41797 4.33301C7.24642 4.2679 7.04565 4.22014 6.86035 4.19141C6.67958 4.16339 6.47447 4.1473 6.30078 4.16602Z"
            fill="#FE4332"
            stroke="black"
          />
        </svg>
        <span class="text-[#274138] text-[0.75rem]"> Перейти в Яндекс.Карты </span>
      </div>
      <svg width="9" height="14" viewBox="0 0 9 14" fill="none" xmlns="http://www.w3.org/2000/svg">
        <path d="M0.742188 1L6.74219 7L0.742188 13" stroke="#274138" stroke-width="2" />
      </svg>
    </a>
  </div>
</template>
